      **
      * COPY BOOK MAIN MENU WORKING STORAGE
      **
       77  WRK-OPTION               PIC X(01)  VALUE SPACES.
       77  WRK-KEYS                 PIC X(70)  VALUE SPACES.
