      **
      * COPY BOOK MOVIES DATA FILE
      **
       01 WS-ABEND.
           05 WS-ABEND-CODE         PIC 9(02) VALUE ZEROES.
           05 WS-ABEND-MESSAGE      PIC X(40) VALUE SPACES.
