      **
      * COPY BOOK SEARCH RECORD GENRES
      **
       01  LNK-GENRES.
           05  LNK-GEN-COD          PIC X(02) VALUE ZEROES.
           05  LNK-GEN-DESC         PIC X(08) VALUE SPACES.
           05  LNK-GEN-DESC-LINE    PIC 9(02) VALUE ZEROES.
           05  LNK-GEN-STATUS       PIC 9(01) VALUE ZEROES.
