      **
      * COPY BOOK MESSAGE WORKING STORAGE
      **
       01  WRK-MSG.
           05 WRK-MSG-LEN           PIC 9(02) VALUE ZEROES.
           05 WRK-MSG-TEXT          PIC X(70) VALUE SPACES.
           05 WRK-AWAIT             PIC X(01) VALUE SPACES.
